# Joker - a small Clojure interpreter, linter, and formatter written in Go
tap "candid82/brew"    # Hosts the Joker Clojure toolchain (interpreter, linter, formatter)

# Non-free fonts
tap "colindean/fonts-nonfree"    # Adds access to proprietary or restricted-license fonts

# SketchyBar (customizable macOS status bar) and Borders (window border highlighting)
tap "felixkratz/formulae"    # Enables installing macOS status bar replacement and border-highlighting tools

# Backrest - backup tool
tap "garethgeorge/backrest-tap"    # Supplies `backrest`, an automated filesystem backup utility

# Wine compatibility layer
tap "gcenx/wine"    # Provides up-to-date Wine builds for running Windows apps on macOS

# FUSE filesystem support
tap "gromgit/fuse"    # Includes FUSE-based filesystems like NTFS-3G for macOS

# Standard Homebrew taps
tap "homebrew/bundle"    # Homebrew Bundle, for defining dependencies via a Brewfile
tap "homebrew/cask-fonts"    # Official cask repository for fonts
tap "homebrew/cask-versions"    # Alternate versions of cask apps
tap "homebrew/services"    # Commands to manage background services with Homebrew

# NeoMutt email client
tap "neomutt/neomutt"    # Adds the NeoMutt formula for a curses-based mail client

# Various utilities
tap "nikitabobko/tap"    # Contains miscellaneous CLI tools by Nikita Bobko
tap "sgeb/mutt"    # Maintains Mutt email client formulae
tap "snyk/tap"    # Supplies Snyk CLI for security scanning
tap "vitobotta/tap"    # Provides `hetzner_k3s`, a Hetzner K3s Helm provider
tap "yqrashawn/goku"    # Adds Goku, a Karabiner Elements wrapper

# YouTube downloader
tap "yt-dlp/taps"    # Hosts the `yt-dlp` formula for advanced YouTube downloading

# Core libraries and programming languages
brew "openssl"      # TLS/SSL cryptography library version
brew "python"    # Python programming language interpreter
brew "adb-enhanced"   # Extended Android Debug Bridge with additional features
brew "pycparser"      # C parser in pure Python, used by C dependency analyzers
brew "cryptography"   # Python library for cryptographic recipes and primitives
brew "ansible"        # Automation engine for provisioning and configuration management
brew "little-cms2"    # Color management engine for accurate ICC color profiles
brew "webp"           # Utilities for Google’s WebP image format
brew "jpeg-xl"        # JPEG XL image format encoder/decoder
brew "aom"            # AV1 video codec library from the Alliance for Open Media
brew "autoconf"       # Tool to generate configure scripts for building source packages
brew "automake"       # Generates portable Makefiles from `Makefile.am` templates
brew "bat"            # `cat` clone with syntax highlighting and Git integration
brew "black"          # Opinionated Python code formatter
brew "blueutil"       # Command-line utility for managing Bluetooth on macOS
brew "boost"          # Peer-reviewed portable C++ source libraries
brew "borgmatic"      # Simple wrapper for Borg backups
brew "gettext"        # GNU internationalization utilities
brew "glib"           # Core application building blocks for C
brew "cairo"          # 2D graphics library with support for multiple output devices
brew "chezmoi"        # Manage dotfiles across machines securely
brew "cloudflared"    # Cloudflare Tunnel client for secure inbound connections
brew "cmake"          # Cross-platform build system generator
brew "dfu-util"       # Device Firmware Update USB utilities
brew "dnsmasq"        # Lightweight DNS/DHCP server (`dnsmasq`, auto‐restarted on change)
brew "docker"         # Docker CLI client (does not auto-link binaries)
brew "docker-machine" # Tool for provisioning Docker hosts
brew "docutils"       # Python library for processing reStructuredText
brew "dos2unix"       # Convert text files between DOS and Unix line endings
brew "esptool"        # Utility to communicate with ESP8266/ESP32 ROM bootloader
brew "exiftool"       # Read/write EXIF, IPTC, and XMP metadata
brew "eza"            # Rust rewrite of `exa`, a modern replacement for `ls`
brew "f3"             # Tools to verify SD card capacity and speed
brew "libevent"       # Event notification library for scalable asynchronous apps
brew "unbound"        # Validating, recursive, caching DNS resolver
brew "gnutls"         # Secure communications library implementing TLS
brew "harfbuzz"       # OpenType text shaping engine
brew "libass"         # ASS/SSA subtitle renderer for multimedia
brew "mpg123"         # High-performance MPEG audio player/decoder
brew "pango"          # Library for layout and rendering of internationalized text
brew "tesseract"      # Optical character recognition engine
brew "ffmpeg"         # Complete solution to record, convert, and stream audio/video
brew "fzf"            # General-purpose command-line fuzzy finder
brew "gdk-pixbuf"     # Image loading library for GTK applications
brew "gh"             # GitHub’s official command-line tool
brew "git"            # Distributed version control system
brew "git-delta"      # Syntax-highlighting pager for `git` and diff output
brew "git-flow-avh"   # Git extensions to provide high-level repository operations
brew "go"             # Go programming language compiler and tools
brew "gobject-introspection"  # Generate metadata for GObject libraries
brew "qrencode"       # QR Code generation library and command-line tool
brew "google-authenticator-libpam"  # PAM module for TOTP two-factor authentication
brew "googletest"     # Google’s C++ test framework
brew "gperf"          # Perfect hash function generator
brew "libmng"         # Multiple-image Network Graphics library
brew "qt"             # Cross-platform application and UI framework
brew "gpsbabel"       # Convert and transfer GPS waypoint data
brew "libtool"        # Generic library support script
brew "guile"          # GNU Ubiquitous Intelligent Language for Extensions (Scheme)
brew "helm"           # Kubernetes package manager
brew "ifstat"         # Display network interfaces bandwidth
brew "iperf3"         # Network bandwidth measurement tool
brew "python@3.12"    # Python programming language interpreter v3.12
brew "iproute2mac"    # macOS port of Linux `iproute2` networking utilities
brew "ipython"        # Enhanced interactive Python shell
brew "jq"             # Command-line JSON processor
brew "node"           # JavaScript runtime and package manager
brew "pandoc"         # Universal document converter
brew "jupyterlab"     # Next-generation web-based user interface for Jupyter notebooks
brew "libev"          # High-performance event loop library
brew "libwebsockets"  # Lightweight C library for WebSocket clients and servers
brew "lsusb"          # List USB devices on macOS
brew "lua"            # Lightweight scripting language
brew "lua@5.3"        # Legacy Lua 5.3 interpreter
brew "luarocks"       # Lua package manager
brew "macvim"   # MacVim GUI for Vim editor
brew "make"           # Utility to maintain groups of programs
brew "mas"            # Mac App Store command-line interface
brew "mbpoll"         # Command-line MODBUS master simulator
brew "midnight-commander"  # Text-based file manager

# Terminal and networking utilities
brew "minicom"        # Serial communication program
brew "mosquitto"   # MQTT message broker (auto-restarted on change)
brew "multimarkdown"  # Enhanced Markdown processor
brew "mypy"           # Static type checker for Python
brew "neovim"         # Hyperextensible Vim-based text editor
brew "nfcutils"       # Utilities for NFC cards and tags
brew "nmap"           # Network exploration and security auditing tool
brew "offlineimap"   # Synchronize IMAP mailboxes locally
brew "openjdk"        # Open-source Java Development Kit
brew "pkcs11-helper"  # Helper library for PKCS #11 modules
brew "openvpn"   # OpenVPN client/server for secure tunnels
brew "osx-cpu-temp"   # Display CPU temperature in menu bar or shell
brew "parquet-tools"   # Inspect Apache Parquet files
brew "pcre"            # Perl-compatible regular expressions library
brew "pcsc-lite"       # PC/SC smart card framework
brew "pipx"            # Install and run Python applications in isolated environments
brew "platformio"      # Ecosystem for embedded development
brew "postgresql@14"   # PostgreSQL version 14 database server
brew "powerlevel10k"   # Theme for Zsh prompt with instant prompt and segments
brew "pv"              # Monitor data throughput in pipelines
brew "pyenv"           # Python version management tool
brew "pyenv-virtualenv"  # Pyenv plugin to manage virtualenvs
brew "python-lsp-server"  # Language Server Protocol implementation for Python
brew "python-tabulate"    # Pretty-print tabular data in Python
brew "python@3.10"       # Python programming language interpreter v3.10
brew "python@3.11"       # Python programming language interpreter v3.11
brew "tcl-tk"            # Toolkit for building GUIs for scripting languages
brew "python@3.8"        # Python programming language interpreter v3.8
brew "python@3.9"        # Python programming language interpreter v3.9
brew "qemu"              # Emulation and virtualization for multiple architectures
brew "qt@5"              # Qt application framework version 5
brew "ranger"            # Console file manager with VI key bindings
brew "reattach-to-user-namespace"  # Helper for tmux and other shells on macOS
brew "restic"            # Fast, efficient backup program
brew "rsync"             # File copy and synchronization tool
brew "rust"              # Rust programming language toolchain
brew "smartmontools"     # SMART disk monitoring utilities
brew "snapcraft"         # Build and publish Snap packages
brew "sphinx-doc"        # Python documentation generator
brew "stm32flash"        # Flash microcontrollers via ST-Link/V2 USB
brew "stunnel"           # SSL/TLS tunnel wrapper
brew "telnet"            # TELNET client
brew "the_silver_searcher"  # `ag`, a code-searching tool similar to `ack`
brew "thefuck"           # Corrects mistyped shell commands
brew "tlrc"              # Terminal Layout and Recording Controller
brew "tmux"              # Terminal multiplexer
brew "tor"               # The Onion Router for anonymous communication
brew "unp"               # Extract and decompress archives
brew "urlview"           # Pull URLs from text and open in browser
brew "uvicorn"           # ASGI web server implementation for Python
brew "w3m"               # Text-based web browser
brew "wget"              # Network downloader
brew "yamlfmt"           # Formatter for YAML files
brew "yt-dlp"            # YouTube-dl fork with additional features
brew "zoxide"            # Smarter `cd` command that learns your habits
brew "zsh-syntax-highlighting"  # Fish-like syntax highlighting for Zsh

# Window border highlighting for macOS 14.0+
brew "felixkratz/formulae/borders"    # Highlights focused windows with colored borders

# Customizable macOS status bar replacement
brew "felixkratz/formulae/sketchybar"  # Highly configurable macOS menubar replacement

brew "garethgeorge/backrest-tap/backrest"  # Installs Backrest backup tool
brew "gromgit/fuse/ntfs-3g-mac"            # NTFS read/write support on macOS via FUSE
brew "snyk/tap/snyk"                       # Installs Snyk CLI for security vulnerability scanning
brew "vitobotta/tap/hetzner_k3s"            # Hetzner Cloud provider plugin for K3s on Helm
brew "yqrashawn/goku/goku"                 # Installs Goku GUI for Karabiner Elements

# CLI and GUI applications
#### optional, uncomment if needed
# cask "aerospace"
# cask "keyboard-maestro"
# cask "setapp"
# cask "commandpost"
# cask "vmware-fusion"
# cask "logitech-options"
# cask "little-snitch"
# cask "plex-media-server"
cask "airfoil"                 # Stream audio to AirPlay and other devices
cask "android-platform-tools"  # ADB and Fastboot for Android development
cask "anki"                    # Spaced-repetition flashcard program
cask "anydesk"                 # Remote desktop and screen sharing software
cask "apparency"               # Privacy auditor that detects hidden apps
cask "arduino"                 # Arduino IDE for microcontroller programming
cask "balenaetcher"            # USB/SD card flashing utility
cask "barrier"                 # Share keyboard and mouse between multiple computers
cask "betaflight-configurator" # GUI configurator for Betaflight flight controller firmware
cask "betterdisplay"           # Virtual display and monitor rotation utility
cask "bitwarden"               # Open-source password manager
cask "brave-browser"           # Privacy-focused Chromium-based browser
cask "docker-desktop"          # Docker desktop application with GUI
cask "fig"                     # Command-line autocomplete and shortcuts
cask "firefox"                 # Open-source web browser by Mozilla
cask "font-hack-nerd-font"     # Hack font patched with Nerd Font icons
cask "font-menlo-for-powerline" # Menlo font patched for Powerline
cask "font-meslo-for-powerline" # Meslo font patched for Powerline prompts
cask "font-microsoft-office"   # Microsoft Office suite fonts
cask "font-meslo-for-powerlevel10k"  # Meslo font patched for the Powerlevel10k prompt
cask "font-sf-pro"             # San Francisco Pro system font for developers
cask "gimp"                    # GNU Image Manipulation Program
cask "google-chrome"           # Google’s flagship web browser
cask "google-drive"            # File syncing client for Google Drive
cask "hook"                    # Link files, emails, and web pages together
cask "iina"                    # Modern video player for macOS
cask "inkscape"                # Vector graphics editor
cask "insync"                  # Google Drive and OneDrive sync client
cask "iterm2"                  # Powerful terminal emulator for macOS
cask "jupyter-notebook-ql"     # Quick Look plugin for Jupyter notebooks
cask "jupyter-notebook-viewer" # Quick Look plugin to preview Jupyter notebooks
cask "karabiner-elements"      # Powerful keyboard remapping tool
cask "keka"                    # File archiver for macOS
cask "libreoffice"             # Open-source office productivity suite
cask "losslesscut"             # Simple trimming and cutting of video and audio
cask "macdroid"                # Mount Android devices as external drives
cask "macfuse"                 # File system extension framework for macOS
cask "macs-fan-control"        # Control and monitor Mac’s fans
cask "macvim-app"              # GUI version of MacVim editor
cask "microsoft-remote-desktop" # Microsoft’s official RDP client for macOS
cask "mouseless"               # Keyboard-driven window manager for macOS
cask "ntfstool"                # NTFS read/write mounting tool for macOS
cask "obs"                     # Open Broadcaster Software for streaming/recording
cask "obsidian"                # Markdown-based knowledge base and note-taking app
cask "onedrive"                # Microsoft OneDrive sync client
cask "onyx"                    # macOS maintenance and optimization utility
cask "oracle-jdk"              # Oracle’s Java Development Kit
cask "pdf-expert"              # PDF reader and editor by Readdle
cask "popclip"                 # Contextual editing pop-up for text selection
cask "prusaslicer"             # Slicer software for 3D printing by Prusa
cask "qgis"                    # Geographic Information System application
cask "qlcolorcode"             # Quick Look plugin for source code syntax highlighting
cask "qlimagesize"             # Quick Look plugin to display image dimensions
cask "qlmarkdown"              # Quick Look plugin for Markdown files
cask "qlprettypatch"           # Quick Look plugin for patch files
cask "qlstephen"               # Quick Look plugin for plain text files without extensions
cask "quicklook-csv"           # Quick Look plugin for CSV files
cask "quicklook-json"          # Quick Look plugin for JSON files
cask "quicklookase"            # Quick Look plugin for Adobe Swatch Exchange
cask "sdformatter"             # SD card formatting utility
cask "signal"                  # End-to-end encrypted messaging app
cask "slack"                   # Team communication and collaboration platform
cask "slic3r"                  # Open-source 3D printer slicing engine
cask "spotify"                 # Music streaming application
cask "sqlpro-for-postgres"     # GUI client for PostgreSQL databases
cask "teamviewer"              # Remote access and support software
cask "tigervnc-viewer"         # VNC client for remote desktop sessions
cask "tunnelblick"             # OpenVPN client GUI for macOS
cask "tuxera-ntfs"             # Commercial NTFS driver for macOS
cask "unetbootin"              # Create bootable Live USB drives
cask "utm"                     # QEMU-based virtual machines front-end
cask "visual-studio-code"      # Microsoft’s source-code editor
cask "vlc"                     # Versatile Media Player supporting most formats
cask "wireshark-app"           # Network protocol analyzer GUI
cask "wkhtmltopdf"             # Convert HTML to PDF using WebKit
cask "xquartz"                 # X.Org X Window System for macOS
cask "zed"                     # Lightning-fast code editor
cask "zerotier-one"            # Virtual SD-WAN and network hypervisor

# Mac App Store applications
mas "1Blocker", id: 1365531024           # Content blocker for Safari
mas "Adblock Plus", id: 1432731683       # Blocks ads in Safari
mas "Blackmagic Disk Speed Test", id: 425264550  # Benchmark disk performance
mas "Downlink", id: 1454269192           # Download manager for HTTP(S) and FTP
mas "DuckDuckGo Privacy for Safari", id: 1482920575  # Private search extension
mas "Ghostery – Privacy Ad Blocker", id: 1436953057  # Tracker and ad blocking extension
mas "Home Assistant", id: 1099568401      # Front-end for Home Assistant home automation
mas "HP Smart", id: 1474276998           # HP printer setup and scanning utility
mas "Hush", id: 1544743900               # Mute system audio with a hotkey
mas "Loxone", id: 1159613409             # Smart home control app for Loxone systems
mas "MQTT Explorer", id: 1455214828      # MQTT topic and message explorer
mas "NextDNS", id: 1464122853            # DNS-level ad and tracker blocker
mas "OmniFocus", id: 1346203938          # Task management app using GTD methodology
mas "OneDrive", id: 823766827            # Microsoft OneDrive sync client
mas "Slack", id: 803453959               # Team messaging and collaboration platform
mas "StopTheMadness", id: 1376402589     # Prevents web annoyances and tracking
mas "Tailscale", id: 1475387142          # Zero-config WireGuard mesh VPN
mas "Tampermonkey Classic", id: 1482490089  # User script manager for browsers
mas "Telegram", id: 747648890            # Secure messaging app with cloud chats
mas "WhatsApp", id: 310633997            # End-to-end encrypted messaging app

# VS Code extensions
vscode "ms-ceintl.vscode-language-pack-pl"
vscode "charliermarsh.ruff"                # Fast Python linter
vscode "cschlosser.doxdocgen"              # Generate Doxygen comments for C/C++
vscode "detachhead.basedpyright"           # Enhanced Pyright integration
vscode "eamodio.gitlens"                   # Git supercharged: inline blame and history
vscode "esbenp.prettier-vscode"            # Prettier code formatter integration
vscode "franneck94.c-cpp-runner"           # Run C/C++ files directly in VS Code
vscode "jeff-hykin.better-cpp-syntax"      # Improved syntax highlighting for C++
vscode "kachick.vscode-yamlfmt"            # YAML file formatter
vscode "keesschollaart.vscode-home-assistant"  # Home Assistant config support
vscode "mohsen1.prettify-json"             # Pretty-print JSON files
vscode "moshfeu.diff-merge"                # Side-by-side diff and merge tool
vscode "ms-python.debugpy"                 # Debugger for Python
vscode "ms-python.python"                  # Python language support and IntelliSense
vscode "ms-toolsai.jupyter-keymap"         # Jupyter keyboard shortcuts in VS Code
vscode "ms-vscode-remote.remote-containers"  # Develop inside Docker containers
vscode "ms-vscode-remote.remote-ssh"       # SSH remote development
vscode "ms-vscode-remote.remote-wsl"       # Windows Subsystem for Linux integration
vscode "ms-vscode.cmake-tools"             # CMake support and build integration
vscode "ms-vscode.cpptools"                # C/C++ IntelliSense, debugging, and code browsing
vscode "ms-vscode.cpptools-extension-pack" # Bundle of Microsoft C/C++ extensions
vscode "ms-vscode.cpptools-themes"         # Color themes for C/C++
vscode "ms-vscode.remote-explorer"         # Explorer for remote workspaces
vscode "ms-vsliveshare.vsliveshare"        # Real-time collaborative coding
vscode "pascalreitermann93.vscode-yaml-sort"  # Sort YAML keys alphabetically
vscode "platformio.platformio-ide"         # Embedded development IDE for PlatformIO
vscode "redhat.vscode-yaml"                # YAML language support by Red Hat
vscode "svipas.prettier-plus"              # Enhanced Prettier integration
vscode "twxs.cmake"                        # CMake syntax highlighting
vscode "vadimcn.vscode-lldb"               # Debugging with LLDB
vscode "vscodevim.vim"                     # Vim emulation in VS Code
vscode "zainchen.json"                     # JSON language support and validation